app/controllers/albums_controller.rb

    def create
        @AlbumNew = Album.new(album_params)
        if @AlbumNew.save
---
INSERT INTO "albums" ("cover", "title", "artist", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def edit
       @albumEdit = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 2]]

    def update
        @albumEdit = Album.find(params[:id])
        if @albumEdit.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "albums" SET "artist" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["artist", "Beyoncedsa"], ["updated_at", "2016-06-21 07:43:03.914313"], ["id", 2]]

    def destroy
        @albumDestroy = Album.find(params[:id])
        if @albumDestroy.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 8]]