app/controllers/sessions_controller.rb

    def create
      @userLogin = User.find_by_email(params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "nkokotec@gmail.com"]]