app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "tracks" ("name", "minutes", "album_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sda"], ["minutes", "2"], ["album_id", 1], ["user_id", 2], ["created_at", "2016-06-27 13:09:01.041197"], ["updated_at", "2016-06-27 13:09:01.041197"]]
---
    def create
        #@trackNew.users = current_user
        @albumId = Album.find(params[:album_id])
        @trackNew = @albumId.track.build(tracks_params)
        @trackNew.user = current_user
        if @trackNew.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 7]]
---
    def edit
       @trackEdit = Track.find(params[:id])
        @albumId = Album.find(params[:album_id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tracks" SET "name" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["name", "Crna fantazija"], ["updated_at", "2016-06-21 09:02:18.174568"], ["id", 1]]
---
    def update
        @trackEdit = Track.find(params[:id])
        if @trackEdit.update_attributes(tracks_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 12]]
---
    def destroy
        @trackDestroy = Track.find(params[:id])
        if @trackDestroy.destroy