app/controllers/users_controller.rb

    def index
        @userAll = User.all
---
SELECT "users".* FROM "users"

    def create
        @userNew = User.new(user_params)
        if @userNew.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def edit
       @userEdit = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

    def update
        @userEdit = User.find(params[:id])
        if @userEdit.update_attributes(user_params_edit)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "admin"], ["updated_at", "2016-06-24 14:24:16.622722"], ["id", 1]]

    def destroy
        @userDestroy = User.find(params[:id])
        if @userDestroy.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]